app/Http/Controllers/CartController.php

    public function addToCart( $idProduct )
    {
        // Verificar que haya un carrito del cliente
        $product = Product::find($idProduct);
        $customer = Customer::where('user_id', Auth::user()->id)->first();
---
select * from `customers` where `user_id` = 1 limit 1

    public function getShoppingCart()
    {
        $customer = Customer::where('user_id', Auth::user()->id)->first();
---
select * from `customers` where `user_id` = 1 limit 1