app/Http/Controllers/MethodShippingController.php

    public function index()
    {

        //
        $ship = MethodShipping::with('shop')->get();
---
select * from `method_shippings`
select * from `shops` where `shops`.`id` in (18, 21) and `shops`.`deleted_at` is null